<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"d3c095d8c094e935f24b0b0dbf6e8fb970ede7a83b69f374ef7c08fe3123d935","plan_job_ref":"Job Create terraform plan #4 at https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10337072930","plan_out_hash":"3d469cde8ad0439bc8d9d132354ee54f7f6090a8f60704d8560c3cf97e6c4993","plan_hash":"42a93900ee1c8f9dcb9d8162de49d793dda0d970a2a46ea2e4ea1cf0c9080fe7","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__<details open><summary>With variables</summary>

```hcl
bucket_name     = "ghactions-test-4e908e87c0046cbc8c73e8143d8ba73090475c11"
repository_name = "ghactions-test-4e908e87c0046cbc8c73e8143d8ba73090475c11"
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.bucket.aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "ghactions-test-4e908e87c0046cbc8c73e8143d8ba73090475c11"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all                    = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.bucket.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "aws:kms"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.ecr.aws_ecr_repository.repository will be created
+   resource "aws_ecr_repository" "repository" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "ghactions-test-4e908e87c0046cbc8c73e8143d8ba73090475c11"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all             = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #4](https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10337072930)